import Image from "next/image";
import React from "react";

import img1 from "@/app/public/3d-scannign.jpg";
import img2 from "@/app/public/cartoon-ai-robot-scene.jpg";
import img3 from "@/app/public/ai-translate.jpg";
import img4 from "@/app/public/analyz.jpg";
import img5 from "@/app/public/2044.jpg";
import img6 from "@/app/public/10518817.jpg";
import { ArrowDownWideNarrow, MoveDown } from "lucide-react";

const arr = [
  {
    label: "การประมวลผลภาพและวิดีโอ",
    context: `การประมวลผลภาพและวิดีโอด้วยปัญญาประดิษฐ์ (AI) มีบทบาทสำคัญในหลายๆ ด้านของชีวิตประจำวันและอุตสาหกรรมต่างๆ ดังนี้`,
    info: `- การรู้จำใบหน้า (Facial Recognition)
      AI ใช้ในการระบุและตรวจจับใบหน้าของบุคคลจากภาพถ่ายหรือวิดีโอ โดยมีการนำไปใช้ใน:
      ความปลอดภัย: ระบบตรวจจับใบหน้าในสนามบินหรือสถานที่สาธารณะเพื่อตรวจสอบบุคคลที่ต้องสงสัย
      สมาร์ทโฟน: การปลดล็อกโทรศัพท์ด้วยการสแกนใบหน้า

      - การตรวจจับวัตถุ (Object Detection)
      AI สามารถระบุและติดตามวัตถุต่างๆ ในภาพและวิดีโอได้ เช่น:
      การขับขี่อัตโนมัติ: ระบบการตรวจจับวัตถุในรถยนต์เพื่อหลีกเลี่ยงอุบัติเหตุ
      การเฝ้าระวัง: ระบบกล้องวงจรปิดที่สามารถตรวจจับการเคลื่อนไหวและวัตถุที่ต้องสงสัย

      - การวิเคราะห์ภาพทางการแพทย์ (Medical Imaging)
      AI ช่วยในการวิเคราะห์ภาพถ่ายทางการแพทย์ เช่น ภาพเอ็กซ์เรย์และ MRI เพื่อ:
      การวินิจฉัยโรค: การตรวจหาเนื้องอก มะเร็ง และความผิดปกติอื่นๆ ในภาพถ่ายทางการแพทย์
      การวางแผนการรักษา: การช่วยแพทย์ในการวางแผนการผ่าตัดและการรักษาผู้ป่วย

      - การเพิ่มประสิทธิภาพของภาพและวิดีโอ (Image and Video Enhancement)
      AI สามารถปรับปรุงคุณภาพของภาพและวิดีโอได้ เช่น:
      การลบรอยรบกวน: การลดนอยส์ในภาพถ่ายและวิดีโอที่มีคุณภาพต่ำ
      การปรับความละเอียด: การเพิ่มความละเอียดของภาพและวิดีโอเพื่อให้มีความคมชัดยิ่งขึ้น

      - การสร้างภาพและวิดีโอเสมือนจริง (Virtual and Augmented Reality)
      AI ใช้ในการสร้างสภาพแวดล้อมเสมือนจริงและเสริมความเป็นจริง เช่น:
      เกมส์และความบันเทิง: การสร้างตัวละครและฉากในเกมส์ที่สมจริง
      การศึกษาและการฝึกอบรม: การสร้างสถานการณ์จำลองสำหรับการฝึกอบรมและการศึกษา`,
    img: img1,
  },
  {
    label: "ผู้ช่วยดิจิทัล",
    context: `ผู้ช่วยดิจิทัล (Digital Assistants) คือโปรแกรมคอมพิวเตอร์ที่ใช้เทคโนโลยีปัญญาประดิษฐ์ (AI) เพื่อช่วยเหลือผู้ใช้ในการทำงานประจำวันโดยใช้การสื่อสารด้วยเสียง ข้อความ หรือการแตะหน้าจอ ผู้ช่วยดิจิทัลสามารถทำงานได้หลากหลาย เช่น ตั้งเตือน สั่งงานด้วยเสียง ค้นหาข้อมูล และควบคุมอุปกรณ์สมาร์ทโฮม`,
    info: `- การตั้งเตือนและการแจ้งเตือน
      ผู้ช่วยดิจิทัลสามารถตั้งเตือนสำหรับการนัดหมาย กิจกรรม หรือสิ่งที่ต้องทำในแต่ละวัน
      สามารถส่งการแจ้งเตือนเมื่อถึงเวลาที่กำหนดหรือเมื่อมีเหตุการณ์สำคัญเกิดขึ้น
      
      - การค้นหาข้อมูลและการตอบคำถาม
      ผู้ช่วยดิจิทัลสามารถค้นหาข้อมูลจากอินเทอร์เน็ตและตอบคำถามต่างๆ ที่ผู้ใช้ต้องการทราบ เช่น สภาพอากาศ ข่าวสาร การคำนวณ และข้อมูลทั่วไป
      
      - การควบคุมอุปกรณ์สมาร์ทโฮม
      ผู้ช่วยดิจิทัลสามารถควบคุมอุปกรณ์สมาร์ทโฮม เช่น หลอดไฟ กล้องวงจรปิด และเทอร์โมสแตท ด้วยคำสั่งเสียงหรือแอปพลิเคชัน
      
      - การส่งข้อความและโทรศัพท์
      ผู้ช่วยดิจิทัลสามารถส่งข้อความและโทรศัพท์ให้กับผู้ติดต่อในสมุดโทรศัพท์ของผู้ใช้

      - การทำงานร่วมกับแอปพลิเคชันบุคคลที่สาม
      ผู้ช่วยดิจิทัลสามารถทำงานร่วมกับแอปพลิเคชันบุคคลที่สาม เช่น การสั่งซื้ออาหาร การเรียกรถแท็กซี่ และการจัดการตารางเวลา
      `,
    img: img2,
  },
  {
    label: "การประมวลผลภาษา",
    context: `การประมวลผลภาษา (NLP) เป็นสาขาหนึ่งของปัญญาประดิษฐ์ (AI) ที่มุ่งเน้นการทำให้คอมพิวเตอร์สามารถเข้าใจและตอบสนองต่อภาษาธรรมชาติที่มนุษย์ใช้ ทั้งในรูปแบบข้อความและเสียง NLP มีความสำคัญอย่างยิ่งในการพัฒนาระบบที่สามารถสื่อสารและให้บริการแก่ผู้ใช้ในลักษณะที่เป็นธรรมชาติ`,
    info: `- ผู้ช่วยดิจิทัลและแชทบ็อกซ์ (Digital Assistants and Chatbots)
      ผู้ช่วยดิจิทัลอย่าง Siri, Google Assistant และ Alexa ใช้ NLP ในการตอบคำถามและทำงานตามคำสั่งเสียง
      แชทบ็อกซ์ในเว็บไซต์และแอปพลิเคชันใช้ NLP ในการตอบกลับคำถามและให้บริการลูกค้า

      - การวิเคราะห์อารมณ์ (Sentiment Analysis)
      การวิเคราะห์ความคิดเห็นในโซเชียลมีเดีย รีวิวสินค้า และคำติชมจากลูกค้าเพื่อเข้าใจความรู้สึกและปรับปรุงบริการ

      - การสกัดข้อมูล (Information Extraction)
      การดึงข้อมูลสำคัญจากเอกสารหรือข้อความ เช่น การสกัดชื่อบุคคล สถานที่ และเหตุการณ์จากข่าว
      
      - การแปลภาษา (Machine Translation)
      การแปลภาษาในแบบเรียลไทม์ในแอปพลิเคชันและเว็บไซต์ เพื่อช่วยให้ผู้ใช้ที่พูดภาษาต่างๆ สามารถเข้าใจเนื้อหาได้
      
      - การค้นหาข้อมูล (Information Retrieval)
      การใช้ NLP ในการปรับปรุงระบบค้นหาข้อมูล เช่น Google Search ที่สามารถเข้าใจคำค้นหาและตอบสนองด้วยผลลัพธ์ที่เกี่ยวข้อง
      `,
    img: img3,
  },
  {
    label: "การวิเคราะห์ข้อมูล",
    context: `การวิเคราะห์ข้อมูลด้วยปัญญาประดิษฐ์ (AI) เป็นการใช้เทคโนโลยีเพื่อประมวลผลและวิเคราะห์ข้อมูลขนาดใหญ่ โดย AI สามารถสกัดข้อมูลที่มีความสำคัญ ค้นหาความสัมพันธ์ระหว่างข้อมูล และทำการพยากรณ์เพื่อช่วยในการตัดสินใจ`,
    info: `- การตลาดและการขาย (Marketing and Sales)
      AI ถูกใช้ในการวิเคราะห์พฤติกรรมของลูกค้าเพื่อเสนอผลิตภัณฑ์ที่ตรงกับความต้องการ และการพยากรณ์ยอดขาย
      
      - การเงิน (Finance)
      AI ถูกใช้ในการวิเคราะห์ความเสี่ยง การตรวจสอบการทุจริต และการจัดการพอร์ตการลงทุน
    
      - การแพทย์ (Healthcare)
      AI ถูกใช้ในการวิเคราะห์ข้อมูลทางการแพทย์เพื่อช่วยในการวินิจฉัยโรคและการพยากรณ์การรักษา
      
      - อุตสาหกรรม (Manufacturing)
      AI ถูกใช้ในการวิเคราะห์ข้อมูลจากสายการผลิตเพื่อปรับปรุงประสิทธิภาพและลดข้อผิดพลาด
      
      - การวิเคราะห์ทางสังคมและเศรษฐกิจ (Social and Economic Analysis)
      AI ถูกใช้ในการวิเคราะห์แนวโน้มทางสังคมและเศรษฐกิจ เช่น การวิเคราะห์ตลาดแรงงาน การวิเคราะห์สื่อสังคมออนไลน์ หรือการพยากรณ์การเปลี่ยนแปลงทางเศรษฐกิจ
      `,
    img: img4,
  },
  {
    label: "รถยนต์ขับเคลื่อนอัตโนมัติ",
    context: `รถยนต์ขับเคลื่อนอัตโนมัติ หรือ Autonomous Vehicles (AVs) เป็นเทคโนโลยีที่ใช้ปัญญาประดิษฐ์ (AI) เพื่อควบคุมและนำทางรถยนต์โดยไม่ต้องมีมนุษย์ขับขี่ ระบบ AI ในรถยนต์เหล่านี้สามารถตัดสินใจเกี่ยวกับเส้นทาง ความเร็ว และการหลบหลีกสิ่งกีดขวางได้โดยอัตโนมัติ ทำให้การขับขี่มีความปลอดภัยและสะดวกสบายมากขึ้น`,
    info: `- การเพิ่มความปลอดภัยบนท้องถนน
      AI สามารถตอบสนองต่อสถานการณ์ฉุกเฉินได้รวดเร็วกว่ามนุษย์ และลดความเสี่ยงจากความผิดพลาดที่เกิดจากการขับขี่ของมนุษย์ เช่น การขับรถในสภาพเหนื่อยล้า หรือการเมาแล้วขับ
    
      - การลดอุบัติเหตุและความเสียหาย
      ระบบ AI สามารถประเมินและหลีกเลี่ยงสถานการณ์ที่อาจก่อให้เกิดอุบัติเหตุได้อย่างมีประสิทธิภาพ 
    
      - การเพิ่มประสิทธิภาพการเดินทาง
      รถยนต์ขับเคลื่อนอัตโนมัติสามารถวางแผนเส้นทางและเลือกเส้นทางที่มีการจราจรน้อยที่สุด ช่วยลดเวลาในการเดินทางและประหยัดพลังงาน
      
      - การสนับสนุนผู้ที่มีข้อจำกัดในการขับขี่
      รถยนต์ขับเคลื่อนอัตโนมัติสามารถช่วยให้ผู้สูงอายุหรือผู้ที่มีความบกพร่องทางการเคลื่อนไหวสามารถเดินทางได้โดยไม่ต้องพึ่งพาผู้อื่น
      
      - การเปลี่ยนแปลงในภาคอุตสาหกรรมและการขนส่ง
      การขนส่งสินค้าและโลจิสติกส์จะมีความคล่องตัวและมีประสิทธิภาพมากขึ้นเมื่อใช้รถยนต์ขับเคลื่อนอัตโนมัติ ซึ่งจะช่วยลดต้นทุนการขนส่ง
      `,
    img: img5,
  },
  {
    label: "หุ่นยนต์และอัตโนมัติในอุตสาหกรรม",
    context: `หุ่นยนต์และระบบอัตโนมัติในอุตสาหกรรมเป็นเทคโนโลยีที่มีการใช้ปัญญาประดิษฐ์ (AI) เพื่อเพิ่มประสิทธิภาพในกระบวนการผลิต โดย AI สามารถทำงานที่ซับซ้อน และควบคุมหุ่นยนต์ในการทำงานต่างๆ ได้อย่างแม่นยำและรวดเร็ว ซึ่งช่วยให้โรงงานและอุตสาหกรรมต่างๆ สามารถผลิตสินค้าที่มีคุณภาพสูงและมีต้นทุนต่ำลง`,
    info: `- อุตสาหกรรมยานยนต์ (Automotive Industry)
      หุ่นยนต์ที่ควบคุมด้วย AI ถูกใช้ในการประกอบรถยนต์ การเชื่อม และการทาสี เพื่อให้การผลิตเป็นไปอย่างรวดเร็วและมีคุณภาพสูง

      - อุตสาหกรรมอิเล็กทรอนิกส์ (Electronics Industry)
      หุ่นยนต์ถูกใช้ในการประกอบชิ้นส่วนอิเล็กทรอนิกส์ที่มีความละเอียดสูง เช่น การผลิตสมาร์ทโฟนและคอมพิวเตอร์
    
      - อุตสาหกรรมอาหารและเครื่องดื่ม (Food and Beverage Industry)
      หุ่นยนต์ที่ใช้ AI ถูกใช้ในการบรรจุและบรรจุภัณฑ์สินค้า การตรวจสอบคุณภาพ และการจัดการโลจิสติกส์
      `,
    img: img6,
  },
];

export default function Infosection_2() {
  return (
    <div
      className="w-[100%] max-h-fit
      flex flex-row justify-start items-center px-20 gap-[5rem]
    "
    >
      <div className="flex flex-col pt-[20rem]">
        <div className=" text-5xl font-semibold pb-1">
          พื้นฐานของ AI และวิธีการใช้ในปัจจุบัน
        </div>
        <div className=" text-2xl font-semibold pb-[10rem]">
          การใช้ AI ในปัจจุบัน
          <div className="py-7">
            <MoveDown size={50} />
          </div>
        </div>
        <div className="flex flex-col ">
          {arr.map((item) => (
            <>
              <div className="flex flex-row justify-between gap-[5rem] px-10">
                <div className="">
                  <div className=" text-4xl font-semibold pb-10">
                    {item.label}
                  </div>
                  <div>{item.context}</div>
                  <div className=" text-xs py-5 ">
                    {item.info.split("\n").map((line, index) => (
                      <React.Fragment key={index}>
                        {line}
                        <br />
                      </React.Fragment>
                    ))}
                  </div>
                </div>
                <div className="pb-20">
                  <Image
                    className=" rounded-xl border border-black w-[70rem]"
                    src={item.img}
                    alt={item.label}
                  />
                </div>
              </div>
              <hr className="pb-[10rem] opacity-25" />
            </>
          ))}
        </div>
      </div>
    </div>
  );
}
