import Image from "next/image";
import React from "react";

import qwenImg from "@/app/public/Qwen2-Logo.jpeg";
import infoHeaderImage from "@/app/public/infoHeader.jpg";
import { Button } from "@/components/ui/button";
import Link from "next/link";
import { MoveRight } from "lucide-react";

type Props = {};

export default function Qwen2_Section({}: Props) {
  return (
    <div
      className="w-[100%] max-h-fit
      flex flex-row justify-start items-center px-40 gap-[5rem]
    "
    >
      <div className="flex flex-row items-center">
        <div className=" flex flex-col pr-10 w-[70rem]">
          <div className=" text-3xl font-semibold pb-7">
            Qwen-2 (Alibaba Cloud)
          </div>
          <div className="text-md pb-14">
            Qwen-2 เป็นโมเดลปัญญาประดิษฐ์ที่พัฒนาโดย Alibaba Cloud
            ซึ่งเป็นรุ่นปรับปรุงของ Qwen
            ที่ได้รับการพัฒนาเพิ่มเติมเพื่อเพิ่มความสามารถในการประมวลผลภาษาธรรมชาติ
            (NLP) และการทำงานที่ซับซ้อนมากขึ้น โมเดล Qwen-2
            ได้รับการออกแบบมาเพื่อให้มีประสิทธิภาพในการตอบสนองและเข้าใจข้อความที่มีความซับซ้อน
            ทั้งในงานสร้างสรรค์และการวิเคราะห์ข้อมูล
            <br />
            ความสามารถหลักของ Qwen-2
            <br />
            - การสร้างและเข้าใจข้อความ (Text Generation and Understanding):
            Qwen-2 สามารถสร้างข้อความที่ซับซ้อนและมีความหมาย
            รวมถึงสามารถเข้าใจบริบทของข้อความที่กำลังประมวลผล
            ซึ่งทำให้เหมาะสำหรับการใช้ในงานเขียน การสนทนาอัตโนมัติ
            และการวิเคราะห์เนื้อหา
            <br />
            - การวิเคราะห์ข้อมูล (Data Analysis): Qwen-2
            มีความสามารถในการวิเคราะห์และสรุปข้อมูลจากแหล่งต่างๆ เช่น
            การสรุปรายงาน การวิเคราะห์ความคิดเห็นของลูกค้า
            หรือการประมวลผลข้อมูลที่ซับซ้อน
            <br />
            - การรองรับหลายภาษา (Multilingual Support): Qwen-2
            สามารถทำงานได้ในหลายภาษา
            ซึ่งทำให้สามารถนำไปใช้ในบริบทการสื่อสารระหว่างประเทศ
            หรือการแปลภาษาที่ต้องการความแม่นยำและเข้าใจบริบทอย่างดี
            <br />
            - การปรับแต่งตามความต้องการ (Customization):
            โมเดลนี้สามารถปรับแต่งให้เหมาะสมกับงานเฉพาะหรือโดเมนเฉพาะได้ เช่น
            การใช้งานในอุตสาหกรรมเฉพาะทาง การพัฒนาระบบการสนทนา
            หรือการสร้างเนื้อหาสำหรับเว็บไซต์และสื่อออนไลน์
            <br />
            - ประสิทธิภาพสูงและปรับขนาดได้ (High Performance and Scalability):
            Qwen-2
            ถูกออกแบบมาให้สามารถทำงานได้อย่างรวดเร็วและมีประสิทธิภาพในสภาพแวดล้อมที่มีข้อมูลจำนวนมาก
            และสามารถปรับขนาดการทำงานได้ตามความต้องการ
            <br />
            <div className="pb-1">
              คำแนะนำในการนำ Qwen-2 ไปประยุกต์ใช้ เช่น:
            </div>
            <br />
            - การสร้างเนื้อหาสำหรับการตลาดและสื่อออนไลน์ (Content Creation for
            Marketing and Online Media) Qwen-2
            สามารถใช้ในการสร้างเนื้อหาที่มีคุณภาพสูงสำหรับการตลาด เช่น บทความ
            โพสต์บนโซเชียลมีเดีย หรือคำอธิบายสินค้า
            ทำให้การสร้างสรรค์เนื้อหามีความรวดเร็วและตรงกับกลุ่มเป้าหมาย
            <br />
            - การพัฒนาแชทบอทและการสนทนาอัตโนมัติ (Chatbot Development and
            Automated Conversations) คุณสามารถใช้ Qwen-2
            ในการพัฒนาแชทบอทที่สามารถเข้าใจและตอบสนองต่อผู้ใช้งานได้อย่างมีประสิทธิภาพ
            รวมถึงการใช้งานในระบบสนับสนุนลูกค้า การให้คำแนะนำ
            หรือการช่วยเหลือในการทำธุรกรรมต่างๆ
            <br />
            - การวิเคราะห์ข้อมูลเชิงลึก (In-Depth Data Analysis) Qwen-2
            เหมาะสำหรับการวิเคราะห์ข้อมูลที่ซับซ้อน เช่น
            การวิเคราะห์ความคิดเห็นของลูกค้า การสรุปข้อมูลทางการเงิน
            หรือการประมวลผลข้อมูลเชิงลึกเพื่อช่วยในการตัดสินใจทางธุรกิจ
            <br />
            - การแปลภาษาและการสื่อสารระหว่างวัฒนธรรม (Language Translation and
            Cross-Cultural Communication) ความสามารถในการทำงานหลายภาษาของ Qwen-2
            ทำให้สามารถใช้ในการแปลเอกสาร การสื่อสารระหว่างทีมงานต่างประเทศ
            หรือการสร้างเนื้อหาที่สอดคล้องกับวัฒนธรรมและภาษาในแต่ละภูมิภาค
            <br />- การสนับสนุนการศึกษาและการวิจัย (Educational and Research
            Support) Qwen-2 สามารถช่วยในการสร้างเนื้อหาการศึกษา
            การสรุปบทความวิชาการ หรือการวิเคราะห์ข้อมูลการวิจัย
            ทำให้นักเรียนและนักวิจัยสามารถทำงานได้อย่างรวดเร็วและมีประสิทธิภาพมากขึ้น
          </div>
        </div>
        <Image src={qwenImg} alt="" width={620} />
      </div>
    </div>
  );
}
